ИБРесторанБыстрогоПитания/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <attributes>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтола</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИБРесторанБыстрогоПитания/src/Documents/Заказ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку("---------------------------------------------------------------------------");
	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗакрытия) Тогда 
		ТекстовыйДокумент.ДобавитьСтроку("  ПРЕДВАРИТЕЛЬНЫЙ ЧЕК, ЗАКАЗ НЕ ЗАКРЫТ");
	КонецЕсли;
	ТекстовыйДокумент.ДобавитьСтроку("  Чек: " + Объект.Номер + "         " + Формат(Объект.ДатаОткрытия,"ДЛФ=ДВ"));
	ТекстовыйДокумент.ДобавитьСтроку("  Стол: " + Объект.НомерСтола);
	ТекстовыйДокумент.ДобавитьСтроку("  Официант: " + Объект.Официант);
	ТекстовыйДокумент.ДобавитьСтроку("---------------------------------------------------------------------------");
	Блюда = Объект.Блюда;
	Для Каждого Позиция из Блюда Цикл
		ТекстовыйДокумент.ДобавитьСтроку("  Наим: " + Позиция.Блюдо + "    Кол-во: " + Позиция.Количество + "    Цена: " + Позиция.Цена + "    Сумма: " + Позиция.Сумма);  
	КонецЦикла;
	ТекстовыйДокумент.ДобавитьСтроку("===========================================================================");
	//Итого = РаботаСоСправочником.ИтоговыйСчёт(Блюда);
	ТекстовыйДокумент.ДобавитьСтроку("  Итого: " + Объект.Блюда.Итог("Сумма") + " руб.");
	ТекстовыйДокумент.ДобавитьСтроку("===========================================================================");
	ТекстовыйДокумент.Показать();

КонецПроцедуры

&НаКлиенте
Процедура БлюдаЦенаПриИзменении(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.Блюда.ТекущиеДанные) ;
КонецПроцедуры

&НаКлиенте
Процедура БлюдаКоличествоПриИзменении(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.Блюда.ТекущиеДанные) ;
КонецПроцедуры

&НаКлиенте
Процедура БлюдаБлюдоПриИзменении(Элемент)
	
	Цена = РаботаСоСправочником.ЦенаНаБлюдо(Объект.ДатаОткрытия, Элементы.Блюда.ТекущиеДанные.Блюдо);
	Элементы.Блюда.ТекущиеДанные.Цена = Цена; 
	Если Элементы.Блюда.ТекущиеДанные.Количество = 0 Тогда 
		Элементы.Блюда.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	РаботаСДокументами.РассчитатьСумму(Элементы.Блюда.ТекущиеДанные);
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Объект.ДатаЗакрытия = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	
	Если  Параметры.Ключ.Пустая() Тогда
		Объект.ДатаОткрытия = ТекущаяДата();
	КонецЕсли; 
	
	ТолькоПросмотр = ЗначениеЗаполнено(Объект.ДатаЗакрытия);
	
КонецПроцедуры
